app/controllers/products_controller.rb

  def create
    Product.create(product_params)
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at", "inventory", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["price", 3], ["created_at", "2019-08-02 19:14:30.152690"], ["updated_at", "2019-08-02 19:14:30.152690"], ["inventory", 12], ["description", "This is a great thing"]]